[
  {   
    "id":0,
    "date":"2022-05-20T17:30:00",
    "events": [
      {
        "start_date": "2022-05-20T17:00:00",
        "end_date": "2022-05-20T17:30:00",
        "event_name": "Opening Ceremony",
        "event_description": "Kick off the Hackathon with us! We'll be introducing our wonderful team of students who made this possible, our industry partners, and go through our various categories and prizes! "
      },
      {
        "start_date": "2022-05-20T17:30:00",
        "end_date": "",
        "event_name": "Hacking Begins",
        "event_description": "Hacking starts now! Get programming, you have 48 hours to make something awesome! Be sure to submit your project to our Devpost before 5:30pm on Sunday."
      },
      {
        "start_date":"2022-05-20T18:00:00",
        "end_date": "2022-05-20T19:00:00",
        "event_name": "Intro to GitHub with Sooraj Modi",
        "event_description": "Join Sooraj, a Software Developer at CineSend, for an introduction to Git and GitHub. The workshop will go over what it is, what it does, how to use it, and why its such an important tool. No experience is required, this workshop is suitable to all experience levels."
      },
      {
        "start_date":"2022-05-20T19:00:00",
        "end_date": "2022-05-20T19:45:00",
        "event_name": "What They Don't Tell You About Tech Interviews with Fatima Taj",
        "event_description": "Join Software engineer Fatima Taj as she presents on the often overwhelming and misunderstood world of tech interviews. Tune in on Friday at 7pm to learn tips for getting interviews, how to properly navigate the interview itself, and important steps to take afterwards."
      },
      {
        "start_date": "2022-05-20T20:00:00",
        "end_date": "2022-05-20T20:45:00",
        "event_name": "Intro to React with Saqif Abrar",
        "event_description": "Interested in building your own dream websites? Get started with the React workshop where you'll learn how to use front-end skills to build up your web dev skills and expand your portfolio.\n\nTune is at 8pm on Friday to get started with the basics, learn React hooks and receive some useful tips to build up your React knowledge. All you'll need to know is basic HTML and CSS to get started!"
      },
      {
        "start_date": "2022-05-20T21:00:00",
        "end_date": "2022-05-20T21:45:00",
        "event_name": "Wireless Integration for your Hardware Hack",
        "event_description": "General overview of tooling and techniques available to add wireless communication capabilities, particularly remote control, data collection and transfer. Content mainly suited for hardware hackers or those versed enough in backend who are curious, but anyone may take inspiration."
      },
      {
        "start_date": "2022-05-20T22:00:00",
        "end_date": "2022-05-20T22:30:00",
        "event_name": "Scribble.io Competition",
        "event_description": "Silly Social #1! Tired of staring at your code? Take a break and relax! Join us for a few rounds of scribble.io for some silly doodling fun!"
      },
      {
        "start_date": "2022-05-20T22:00:00",
        "end_date": "2022-05-20T22:30:00",
        "event_name": "Among Us Tournament",
        "event_description": "Not over the space themed imposter game that gripped our attention at the start of this pandemic? Us either! Join in to play a few rounds of the game with other hackies, make friends, and see if you can catch the imposter! (or evade being caught)"
      },
      {
        "start_date": "2022-05-20T23:30:00",
        "end_date": "",
        "event_name": "Late Night Radio Show",
        "event_description": "Every evening our OC team will be staying up all night with you, playing music, answering questions, interviewing guests, and more! Tune in on discord to hear goof, gaffs, laughs, and get a chance to chat with us about whatever is on your mind throughout the late nights!"
      }
    ]
  },
  {   
    "id":1,
    "date":"2022-05-21T00:00:00",
    "events": [
      {
        "start_date": "",
        "end_date": "2022-05-21T03:00:00",
        "event_name": "Late Night Radio Show",
        "event_description": "Every evening our OC team will be staying up all night with you, playing music, answering questions, interviewing guests, and more! Tune in on discord to hear goof, gaffs, laughs, and get a chance to chat with us about whatever is on your mind throughout the late nights!"
      },
      {
        "start_date": "2022-05-21T04:00:00",
        "end_date": "2022-05-21T04:45:00",
        "event_name": "The Wiki Game",
        "event_description": "Take a pause, take a breath, and take a chance in a casual race through Wikipedia's hundred of articles to try and find the target page in this social."
      },
      {
        "start_date": "2022-05-21T11:00:00",
        "end_date": "2022-05-21T12:00:00",
        "event_name": "Team Trivia",
        "event_description": "Networking Social #1! Come out and meet some other competitors, judges, OC members, and more in this fun game of general trivia! You'll be assigned to a team of 5 people based on a 'build your own adventure' game, and have a chance to chat, and puzzle over our questions."
      },
      {
        "start_date": "2022-05-21T11:00:00",
        "end_date": "2022-05-21T12:00:00",
        "event_name": "Murder Mystery!",
        "event_description": "Join us for a spirited and goofy murder mystery game! You'll be placed in zoom calls with up to 18 other competitors, given a detailed character profile, and challenged to solve the murder mystery before your time runs out!"
      },
      {
        "start_date": "2022-05-21T14:00:00",
        "end_date": "2022-05-21T14:45:00",
        "event_name": "Intro to Web Development with Juberiya Ajaz",
        "event_description": "Join Juberiya to get a structured introduction to everything you need to know about becoming a front-end web developer. Front-end web development (also known as client-side development) is the practice of producing HTML, CSS, and JavaScript for a website or Web Application so that a user can see and interact with them directly. This workshop will cover how to get started with HTML, CSS, and JavaScript."
      },
      {
        "start_date":"2022-05-21T15:00:00",
        "end_date": "2022-05-21T15:30:00",
        "event_name": "Dictionary Mystery",
        "event_description": "Think you know the English language? We doubt it! Join members of our organizing committee and try to guess the definitions of this incredibly uncommon words! We guarantee some fun, some confusion, and lots of linguistic challenges."
      },
      {
        "start_date":"2022-05-21T15:45:00",
        "end_date": "2022-05-21T16:45:00",
        "event_name": "Industry Professionals Q&A Panel",
        "event_description": "Tune in on Saturday at 3:45pm to learn about the journeys and experiences of several seasoned industry professionals and UofG Graduates who are now working at world-renowned companies from the Fortune 500 including Meta, Apple, Amazon, and Google. Come on out and ask whatever career questions are on your mind and get advice from experienced industry veterans!"
      },
      {
        "start_date":"2022-05-21T17:00:00",
        "end_date": "2022-05-21T18:30:00",
        "event_name": "LeetCode Night",
        "event_description": "Join us to enhance your skills, expand your knowledge and prepare for technical interviews as we attempt to solve some famous questions on livestream! We'll be sharing links to all the questions so feel free to attempt the questions on your own and drop screenshots of your code results/efficiency in our #leetcode-stats channel!"
      },
      {
        "start_date":"2022-05-21T18:45:00",
        "end_date": "2022-05-21T19:30:00",
        "event_name": "GeoGuesser",
        "event_description": "We live on a big planet, bigger then we realize sometimes! In this social we'll work together to solve a few instances of the incredibly challenging GeoGuessr! Get dropped on a street view of google maps and try to figure out where exactly you are in the world! We can't promise we'll win, but we're going to try out best and have fun doing it!"
      },
      {
        "start_date":"2022-05-21T20:00:00",
        "end_date": "2022-05-21T20:45:00",
        "event_name": "How to Win a Hackathon with Robert Ciborowski",
        "event_description": "Join computer science student, and hackathon veteren, Robert Ciborowski as he teaches the skills required in order to produce a top hackathon project, including idea, technology & implementation, presentation, and the right teammates!  Tune in on Saturday at 8pm to learn Robert's winning hackathon recipe, including the ideation process, picking the right technologies, how to build your project, creating the best presentation, and forming your hackathon dream team!"
      },
      {
        "start_date":"2022-05-21T23:30:00",
        "end_date": "",
        "event_name": "Late Night Radio Show",
        "event_description": "Every evening our OC team will be staying up all night with you, playing music, answering questions, interviewing guests, and more! Tune in on discord to hear goof, gaffs, laughs, and get a chance to chat with us about whatever is on your mind throughout the late nights!"
      }
    ]
  },
  {   
    "id":2,
    "date":"2022-05-22T00:00:00",
    "events": [
      {
        "start_date":"",
        "end_date": "2022-05-22T03:00:00",
        "event_name": "Late Night Radio Show",
        "event_description": "Every evening our OC team will be staying up all night with you, playing music, answering questions, interviewing guests, and more! Tune in on discord to hear goof, gaffs, laughs, and get a chance to chat with us about whatever is on your mind throughout the late nights!"
      },
      {
        "start_date": "2022-05-22T11:00:00",
        "end_date": "2022-05-22T11:45:00",
        "event_name": "Intro to Kotlin with Keefer Rourke",
        "event_description": "Tune in on Sunday at 11am for a beginner-friendly workshop that will get you started building multi-platform applications with Kotlin. Discover the power of sharing code between back-end, mobile apps, and the web with one of the most fun and expressive programming languages out there!"
      },
      {
        "start_date": "2022-05-22T12:00:00",
        "end_date": "2022-05-22T12:45:00",
        "event_name": "echo3D AR and VR Workshop with Alon Grinshpoon",
        "event_description": "Join echo3D's CEO & Founder, Alon Grinshpoon, to learn more about Virtual and Augmented Reality. Tune in to learn how to use echo3D's cloud asset management tool with their tutorial demo! Their 3D-ready cloud platform helps manage & deliver 3D/AR/VR content to apps & devices everywhere."
      },
      {
        "start_date": "2022-05-22T13:00:00",
        "end_date": "2022-05-22T13:45:00",
        "event_name": "Intro to Python with Julian Dominguez-Schatz",
        "event_description": "Join Julian for a beginner level introduction to Python and live coding session with walkthroughs of several examples."
      },
      {
        "start_date": "2022-05-22T15:00:00",
        "end_date": "2022-05-22T16:00:00",
        "event_name": "Countdown to Soft Deadline Podcast",
        "event_description": "For the last hour that submissions are open, our team will be counting down live on our discord radio channel. Tune in to make sure you don't miss the deadline, and celebrate the end of our hackathon with us."
      },
      {
        "start_date": "2022-05-22T16:00:00",
        "end_date": "",
        "event_name": "Devpost Project Draft Submission",
        "event_description": "At this time, all teams should have made a project on Devpost, added their team members to their project if any, and included drafts for their Project Name, Elevator Pitch, and Project Story (Description). This project with rough first drafts of the above mentioned items MUST be submitted by this deadline but can be continued to be edited, added onto and finalized until the Devpost Project Submission Hard Deadline. Anything not mentioned including code or video demos are not required at this time."
      },
      {
        "start_date": "",
        "end_date": "2022-05-22T17:30:00",
        "event_name": "Devpost Project Submission HARD DEADLINE",
        "event_description": "All Devpost projects must be finalized and submitted by this time. Make sure to add all your team members and their contributions as well as look through the submission requirements on our Devpost home page. A few key required items to look out for are a descriptive Project Story/Name/Elevator Pitch, a link to your project's public Github repo, and a link to your maximum 3 minute video submission outlining the features of your project either uploaded to Youtube, Vimeo or any other appropriate streaming service."
      },
      {
        "start_date": "2022-05-22T18:00:00",
        "end_date": "2022-05-22T21:00:00",
        "event_name": "Judging Period - Public Voting Begins",
        "event_description": "For the next 3 hours, judges will look through all the submissions and judge them! In the meantime, you will vote for your favourite project on Devpost! That project will win the People's Choice Award."
      },
      {
        "start_date": "2022-05-22T21:30:00",
        "end_date": "2022-05-22T22:00:00",
        "event_name": "Closing Ceremony",
        "event_description": "End the Hackathon with us! We will be showcasing our wonderful winners and their projects, as well as highlighting our amazing external partners that made this all possible."
      }
    ]
  }
]